Tekla Open API Reference for Tekla Structures 2025
DeformingType Enumeration
 Enumeration for deforming type.
 Namespace: Tekla.Structures.Forming
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DeformingType
Public Enumeration DeformingType
Members
Member name | Value | Description
NOT_SPECIFIED | 0 |  Not specified, default value.
DEFORMED | 1 |  Indiactes deformed item.
UNDEFORMED | 2 |  Indicates undeformed item.
See Also
Reference
Tekla.Structures.Forming Namespace